Revit 2026 API

# SweptProfile Properties

---

The SweptProfile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndSetBack | The distance from the end of the driving curve to the point where the sweep actually ends. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StartSetBack | The distance from the start of the driving curve to the point where the sweep actually begins. |

#### Reference

SweptProfile Class

Autodesk.Revit.DB Namespace